[{"url": "https://repl.it/bugs", "keywords": "IDE,Interpreter,Compiler,Teach,Host,Learn,Code,REPL,Compiler,Clojure,Haskell,Kotlin (beta),QBasic,Forth,LOLCODE,BrainF,Emoticon,Bloop,Unlambda,JavaScript,CoffeeScript,Scheme,APL,Lua,Python 2.7,Ruby,Roy,Python,Nodejs,Deno (beta),Go,C++,C,C#,F#,HTML, CSS, JS,Rust,Swift,Python (with Turtle),Basic (beta),R,Bash,Quil,Crystal,Julia,Elixir,Nim,Dart,Reason NodeJs,Erlang,TypeScript,Pygame,Love2D,Tkinter,Java Swing,Emacs Lisp (Elisp),PHP Web Server,SQLite,Java,PHP CLI,Pyxel", "description": "Repl.it is a simple yet powerful online IDE, Editor, Compiler, Interpreter, and REPL. Code, compile, run, and host in 50+ programming languages: Clojure, Haskell, Kotlin (beta), QBasic, Forth, LOLCODE, BrainF, Emoticon, Bloop, Unlambda, JavaScript, CoffeeScript, Scheme, APL, Lua, Python 2.7, Ruby, Roy, Python, Nodejs, Deno (beta), Go, C++, C, C#, F#, HTML, CSS, JS, Rust, Swift, Python (with Turtle), Basic (beta), R, Bash, Quil, Crystal, Julia, Elixir, Nim, Dart, Reason NodeJs, Erlang, TypeScript, Pygame, Love2D, Tkinter, Java Swing, Emacs Lisp (Elisp), PHP Web Server, SQLite, Java, PHP CLI, Pyxel"}, {"url": "https://repl.it/languages/quil", "keywords": "IDE,Interpreter,Compiler,Teach,Host,Learn,Code,REPL,Compiler,Clojure,Haskell,Kotlin (beta),QBasic,Forth,LOLCODE,BrainF,Emoticon,Bloop,Unlambda,JavaScript,CoffeeScript,Scheme,APL,Lua,Python 2.7,Ruby,Roy,Python,Nodejs,Deno (beta),Go,C++,C,C#,F#,HTML, CSS, JS,Rust,Swift,Python (with Turtle),Basic (beta),R,Bash,Quil,Crystal,Julia,Elixir,Nim,Dart,Reason NodeJs,Erlang,TypeScript,Pygame,Love2D,Tkinter,Java Swing,Emacs Lisp (Elisp),PHP Web Server,SQLite,Java,PHP CLI,Pyxel", "description": "Repl.it is the world-leading online coding platform where you can collaborate, compile, run, share, and deploy Quil online. Code in 50+ programming languages and frameworks!"}, {"url": "https://repl.it/talk/all", "keywords": "IDE,Interpreter,Compiler,Teach,Host,Learn,Code,REPL,Compiler,Clojure,Haskell,Kotlin (beta),QBasic,Forth,LOLCODE,BrainF,Emoticon,Bloop,Unlambda,JavaScript,CoffeeScript,Scheme,APL,Lua,Python 2.7,Ruby,Roy,Python,Nodejs,Deno (beta),Go,C++,C,C#,F#,HTML, CSS, JS,Rust,Swift,Python (with Turtle),Basic (beta),R,Bash,Quil,Crystal,Julia,Elixir,Nim,Dart,Reason NodeJs,Erlang,TypeScript,Pygame,Love2D,Tkinter,Java Swing,Emacs Lisp (Elisp),PHP Web Server,SQLite,Java,PHP CLI,Pyxel", "description": "A friendly platform to share and discuss all things repl.it"}, {"url": "https://repl.it/talk/announcements/Repl-Talk-Rules-and-Guidelines-README/22109", "keywords": "IDE,Interpreter,Compiler,Teach,Host,Learn,Code,REPL,Compiler,Clojure,Haskell,Kotlin (beta),QBasic,Forth,LOLCODE,BrainF,Emoticon,Bloop,Unlambda,JavaScript,CoffeeScript,Scheme,APL,Lua,Python 2.7,Ruby,Roy,Python,Nodejs,Deno (beta),Go,C++,C,C#,F#,HTML, CSS, JS,Rust,Swift,Python (with Turtle),Basic (beta),R,Bash,Quil,Crystal,Julia,Elixir,Nim,Dart,Reason NodeJs,Erlang,TypeScript,Pygame,Love2D,Tkinter,Java Swing,Emacs Lisp (Elisp),PHP Web Server,SQLite,Java,PHP CLI,Pyxel", "description": "Rules The Repl.it community is a place for users to share code, ask questions, and discuss coding-related subjects. We&#x27;re committed to making it a fun and cool space for both aspiring and experienced programmers. To that end, we need to lay down some ground rules: Quality posts When sharing a post do your best to describe what you are sharing and why it&#x27;s interesting. Low effort, irrelevant, inappropriate, or posts that lack contexts will be locked or deleted. Don&#x27;t post homework assignments, we want to see  your  creativity! Adding images, screenshots, stack traces, and of course, repls, typically make posts better. Asking good questions Attributes of a bad question: Vague; doesn&#x27;t fully describe the issue. Does not include a link to a repl or does include their code using a  codeblock . Simply asks &quot;how would I do this?&quot; with no prior effort or investigation. Not open to constructive criticism. If you&#x27;re asking for help with code, you should expect some level of critique. Attributes of a good question: Links to a repl or codeblock with the faulty code (if applicable). Be descriptive: explain what you&#x27;ve tried, what language you&#x27;re using, and anything else that might be relevant. Say what you want/expect the program to do. It&#x27;s unlikely that someone will fix your code for you, so don&#x27;t ask for that. Instead, focus on learning. Sharing interesting repls and apps What the repl does: this should be at least 50 characters. For example saying &quot;It&#x27;s a pizza game&quot; isn&#x27;t very descriptive. Instead say &quot;It&#x27;s a game that simulates making pizza. The goal of the game is to sell 100 pizzas in a single day.&quot; If it&#x27;s not straightforward describe how to use/play your repl/game. Images, screenshots, and gifs might make your post more exciting and interesting. Writing good tutorials Good tutorials are typically detailed and expect little prior knowledge from readers. Try to think from the point-of-view of the reader: What might be confusing or what questions they might have? Images, screenshots, and gifs are proven to make posts more engaging. Examples are important so that readers can follow along. Be ready to provide support: Readers might ask questions or give you feedback. Engaging with your users is a great way to become a better writer. Don&#x27;t plagiarize Don&#x27;t pretend that you made something you didn&#x27;t make. When people find out they&#x27;ll lose respect for your work. Instead, if you forked someone&#x27;s repl or based your code on an existing project then please give credit to the original author. Learn more about plagiarism  here . Here is the section from the  Repl.it ToS  on plagiarism: We respect the intellectual property rights of others. It is our policy to respond to any claim that User Content posted on the Service infringes on the copyright or other intellectual property rights (&quot;Infringement&quot;) of any person or entity. This means at the very least we&#x27;ll take plagiarized posts and repls down and if this persists we will take action against the user. Use the correct category To make it easier to navigate Talk is made up of different &quot;boards&quot; for different categories. When posting, make sure to use the correct one: Ask This category is for asking questions. Typically coding questions, but feel free to use this for coding-related discussions. Check out  @Mosrod&#x27;s guide on asking good questions . Be sure not to fall into the  XY problem  when asking questions. Don&#x27;t ask how to get the last 3 letters of a filename, when you really want the file&#x27;s extension. Share This category is for sharing projects and repls. Learn This category is for tutorials and guides. This is not for asking questions, though you can always leave questions in the comments if something is unclear. Bugs This  is where bug reporting belongs and where the Repl.it team will see them. Feedback This  is where feedback and suggestions belong and where the Repl.it team will see them. How to be helpful Be constructive If you&#x27;re going to give critisism, make it constructive. This means that you should tell people how to fix something rather than just telling them they&#x27;re doing something wrong. Do not spoon-feed Don&#x27;t flat out give someone the script for their question. If they are asking how to do something, suggest steps they could take to accomplish their goal. Focus on teaching. Be patient What&#x27;s obvious to you might be new to someone who&#x27;s new to programming. Never talk down. Remember yourself when you were just a newbie trying to learn and treat the asker how you would&#x27;ve liked to be treated. Answer the question If you want to contribute to a post in Ask, be sure it&#x27;s actually helpful. Do not say things like &quot;Why are you using  x ? You should use  y  instead. Don&#x27;t comment that you don&#x27;t know the answer to an Ask question, you can just ignore it if that&#x27;s the case. Be friendly Be kind to your fellow replers. Never insult people or their work. We have zero tolerance towards bullying. Keep it SFW Keep it clean, or SFW (safe for work). If you wouldn&#x27;t show it to a 10 year old or your grandma, don&#x27;t post it. This includes swearing, it is not allowed. Zero tolerance for hate speech Any abusive or threatening writing that expresses prejudice against a particular group, especially on the basis of race, religion, or sexual orientation will result in an  immediate ban . Other rules Don&#x27;t advertise Don&#x27;t make posts or comments advertising non-programming creations or sites. Don&#x27;t create more accounts for cycles Do not make alternate accounts for voting on your own posts or comments. Don&#x27;t mass upvote people&#x27;s posts or comments Do not upvote every comment or post on a person&#x27;s profile for the sole purpose of giving them more cycles. Common sense Common sense applies to all these rules. There is no &quot;bending the rules,&quot; don&#x27;t try and find an flaw in the wording and use it to your advantage. Basically, don&#x27;t find loopholes and exploit them. Other languages For now, we&#x27;re not supporting non-English languages. This is due to the fact that majority of our users speak only English, and it&#x27;s hard to moderate posts in other languages. Appealing If you believe you were unfairly banned, submit an appeal at contact@repl.it These rules are ever-evolving, and the last update to them was on 2/20/2020."}, {"url": "https://repl.it/talk/announcements/TheForArkLD/22109/189075", "keywords": "IDE,Interpreter,Compiler,Teach,Host,Learn,Code,REPL,Compiler,Clojure,Haskell,Kotlin (beta),QBasic,Forth,LOLCODE,BrainF,Emoticon,Bloop,Unlambda,JavaScript,CoffeeScript,Scheme,APL,Lua,Python 2.7,Ruby,Roy,Python,Nodejs,Deno (beta),Go,C++,C,C#,F#,HTML, CSS, JS,Rust,Swift,Python (with Turtle),Basic (beta),R,Bash,Quil,Crystal,Julia,Elixir,Nim,Dart,Reason NodeJs,Erlang,TypeScript,Pygame,Love2D,Tkinter,Java Swing,Emacs Lisp (Elisp),PHP Web Server,SQLite,Java,PHP CLI,Pyxel", "description": "@TheForArkLD  ã\u0082¸ã\u0083£ã\u0083\u0091ã\u0083\u008bã\u0083¼ã\u0082ºã\u0082³ã\u0083\u009fã\u0083¥ã\u0083\u008bã\u0082¹ã\u0083\u0088ã\u0081§ã\u0081\u0099ã\u0081\u008b..."}, {"url": "https://www.plagiarism.org/article/what-is-plagiarism", "keywords": null, "description": "Understand the definition of plagiarism. "}, {"url": "https://www.plagiarism.org/collection/videos", "keywords": null, "description": ""}, {"url": "http://www.plagiarism.org/collection/videos?page=4", "keywords": null, "description": ""}, {"url": "http://www.plagiarism.org/teaching-about-plagiarism", "keywords": null, "description": "The best way to prevent plagiarism is to educate students on how to properly conduct research, cite, quote, and produce unique and original work. This section contains a large array of recommendations for pedagogy and policy."}, {"url": "http://www.plagiarism.org/video/survival-of-the-fittest-adapting", "keywords": null, "description": "How to introduce plagiarism at the beginning of an undergraduate course so incoming freshmen understand it."}, {"url": "http://www.plagiarism.org/video/how-instructors-respond-to-plagiarism", "keywords": null, "description": "Survey results on how instructors respond to plagiarism when they encounter it."}, {"url": "http://www.plagiarism.org/audience/instructors", "keywords": null, "description": ""}, {"url": "http://www.plagiarism.org/audience/instructors?page=2", "keywords": null, "description": ""}, {"url": "http://plagiarism.org/audience/instructors?page=3", "keywords": null, "description": ""}, {"url": "http://plagiarism.org/audience/instructors", "keywords": null, "description": ""}, {"url": "http://plagiarism.org/video/student-online-research-and-critical", "keywords": null, "description": "How to support students in their use of Wikipedia."}, {"url": "http://plagiarism.org#main-content", "keywords": null, "description": "Plagiarism is a common (and often misunderstood) problem that is often the result of a lack of knowledge and skills. Our mission is to support the education community with a comprehensive set of resources to help students write with integrity."}, {"url": "http://plagiarism.org/video/writing-in-an-internet-environment", "keywords": null, "description": "Looking at how the expectations for academic writing might change as the world becomes more digital."}, {"url": "http://plagiarism.org/collection/articles", "keywords": null, "description": ""}, {"url": "http://plagiarism.org/article/how-to-paraphrase", "keywords": null, "description": "Learn how to paraphrase correctly. "}, {"url": "http://plagiarism.org/audience/students", "keywords": null, "description": ""}, {"url": "http://turnitin.com/en_us", "keywords": null, "description": "Turnitin solutions promote academic integrity, streamline grading and feedback, deter plagiarism, and improve student outcomes."}, {"url": "https://help.turnitin.com", "keywords": null, "description": null}, {"url": "http://turnitin.com/about/media-center", "keywords": null, "description": "Press releases and news coverage from Turnitin."}, {"url": "http://turnitin.com /press/machine-learning-effective-in-catching-contract-cheating ", "keywords": null, "description": null}]
